package HW2;

public class program {
    public static void main(String[] args) {
        
        // Задача 1
        System.out.println("Выполняем задачу 1");

         /**
         * Реализуйте алгоритм сортировки пузырьком числового массива, результат после каждой итерации запишите в лог-файл
         */

         /**
         * Дана json строка (можно сохранить в файл и читать из файла)
         * Написать метод(ы), который распарсит json и, используя StringBuilder,
         * создаст строки вида: Студент [фамилия] получил [оценка] по предмету [предмет]
         * Пример вывода:
         * Студент Иванов получил 5 по предмету Математика.
         * Студент Петрова получил 4 по предмету Информатика.
         * Студент Краснов получил 5 по предмету Физика.
         */

        /**
         * К калькулятору из предыдущего дз добавить логирование
        */

        }

        /**
         * Дана строка sql-запроса "select * from students where ".
         * Сформируйте часть WHERE этого запроса, используя StringBuilder.
         * Данные для фильтрации приведены ниже в виде json строки
         * Если значение null, то параметр не должен попадать в запрос.
         * Параметры для фильтрации: {"name":"Ivanov", "country":"Russia", "city":"Moscow", "age":"null"}
         */
        public static String SqlSelect( Object a){
            String s = "Last String";
            return s;
        }
}
